steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
#include <WiFi.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <SPI.h>
#include <time.h>
#include <sys/time.h>
#include "esp_heap_caps.h"
#include "esp_system.h"

#include "hardware_profile.h"
#include "photopainter_core.h"
#include "offline_schedule_core.h"
#include "device_config_store.h"
#include "queue_client_core.h"
#include "queue_runtime_types.h"
#include "device_http_transport.h"
#if INKTIME_PHOTOPAINTER_ENABLED
#include "photopainter_support.h"
#include "power_manager.h"
#else
#include <GxEPD2_7C.h>
#endif
#include <HardwareSerial.h>
#include "esp_wifi.h"
#include "esp_bt.h"
#include "mbedtls/sha256.h"
#include "mbedtls/version.h"

#include "driver/gpio.h"
#include "driver/rtc_io.h"
#include "soc/soc_caps.h"

// =======================
//  正式版預設不輸出逐步序列 Log；需要除錯時以 -DINKTIME_DEBUG_LOG=1 編譯。
// =======================
#ifndef INKTIME_DEBUG_LOG
#define INKTIME_DEBUG_LOG 0
#endif
#define DEBUG_LOG INKTIME_DEBUG_LOG

HardwareSerial DebugSerial(0);

using inktime::kBoardConfig;

#if INKTIME_PHOTOPAINTER_ENABLED
inktime::PhotoPainterSupport photoPainter(kBoardConfig);
#endif

#if DEBUG_LOG
  #define DBG_BEGIN()    DebugSerial.begin(115200)
  #define DBG_PRINT(x)   DebugSerial.print(x)
  #define DBG_PRINTLN(x) DebugSerial.println(x)
#else
  #define DBG_BEGIN()
  #define DBG_PRINT(x)
  #define DBG_PRINTLN(x)
#endif

static const uint32_t FACTORY_RESET_SAMPLE_DELAY_MS = 5;

// =======================
//  AP 配置页保底：进入 AP 后 5 分钟没保存配置 -> 睡到“下一个刷新点”
// =======================
static const uint32_t AP_TIMEOUT_MS = 5UL * 60UL * 1000UL; // 5 分钟
static const uint8_t AP_MAX_SAVE_ATTEMPTS = 5;

// 實體面板固定 800x480；既有伺服器 payload 契約維持直向 480x800。
static constexpr int EPD_WIDTH  = kBoardConfig.display.width;
static constexpr int EPD_HEIGHT = kBoardConfig.display.height;
static constexpr int FB_WIDTH   = kBoardConfig.payloadWidth;
static constexpr int FB_HEIGHT  = kBoardConfig.payloadHeight;

#if !INKTIME_PHOTOPAINTER_ENABLED
GxEPD2_7C<
  INKTIME_PANEL_CLASS,
  INKTIME_PANEL_CLASS::HEIGHT / 4
> display(
  INKTIME_PANEL_CLASS(
    kBoardConfig.display.spi.cs,
    kBoardConfig.display.dc,
    kBoardConfig.display.reset,
    kBoardConfig.display.busy
  )
);
#endif

// =======================
//  舊版 URL 金鑰 API 已停用；新版透過每台裝置獨立 Bearer Token 取得 Manifest。
// =======================
#define DEVICE_MANIFEST_PATH "/api/device/v1/releases/latest"
#define DEVICE_STATUS_PATH   "/api/device/v1/status"
#define DEVICE_QUEUE_MANIFEST_PATH "/api/device/v1/queue/manifest"
#define DEVICE_QUEUE_ACK_PATH "/api/device/v1/queue/ack"
#define DEVICE_OFFLINE_SCHEDULE_PATH "/api/device/v1/offline-schedule"
#define DEVICE_PAIRING_REQUEST_PATH "/api/device/v1/pairing/request"
#define DEVICE_PAIRING_CLAIM_PATH "/api/device/v1/pairing/claim"
#define DEVICE_PAIRING_REPAIR_PERMISSION_PATH "/api/device/v1/pairing/repair-permission"
#define INKTIME_FIRMWARE_VERSION "2.6.0"

// Secure builds require a compile-time or portal-provisioned trust anchor;
// isolated LAN HTTP remains available only in an explicit development build.
#ifndef INKTIME_ALLOW_INSECURE_DEVICE_HTTP
#define INKTIME_ALLOW_INSECURE_DEVICE_HTTP 0
#endif

// =======================
//  配置存储 / WiFi / WebServer
// =======================
Preferences prefs;
WebServer  server(80);
inktime::DeviceConfigStore configStore;

struct Config {
  String  wifi_ssid;
  String  wifi_pass;
  String  backend_hostport;
  String  ca_pem;
  String  device_token;
  String  device_secret;
  String  device_id;
  String  auth_state;
  uint32_t credential_version;
  int32_t tz_offset_minutes;
  uint8_t refresh_hour;
  uint8_t refresh_minute;
  bool    rotate180;
#if INKTIME_PHOTOPAINTER_ENABLED
  inktime::OfflineSlot schedule_slots[inktime::kMaxOfflineSlots];
  uint8_t schedule_count;
  uint16_t prefetch_lead_minutes;
  String  delivery_mode;
  String  button_wake_action;
#endif
  uint32_t config_version;
  bool    valid;
};

const char*  DEFAULT_HOSTPORT = "";
const int32_t DEFAULT_TZ_MINUTES = 8 * 60;
const uint8_t DEFAULT_HOUR    = 8;
const uint8_t DEFAULT_MINUTE  = 0;
#if INKTIME_PHOTOPAINTER_ENABLED
const uint16_t DEFAULT_PREFETCH_LEAD_MINUTES = 5;

static bool parseOfflineClock(const String &value, inktime::OfflineSlot &slot) {
  if (value.length() != 5 || value[2] != ':') return false;
  if (value[0] < '0' || value[0] > '9' || value[1] < '0' || value[1] > '9'
      || value[3] < '0' || value[3] > '9' || value[4] < '0' || value[4] > '9') return false;
  slot.hour = static_cast<uint8_t>((value[0] - '0') * 10 + value[1] - '0');
  slot.minute = static_cast<uint8_t>((value[3] - '0') * 10 + value[4] - '0');
  return inktime::validOfflineSlot(slot);
}

static bool nextIsoLocalDate(const String &value, String &output) {
  output = "";
  if (value.length() != 10U || value[4] != '-' || value[7] != '-') return false;
  for (uint8_t index = 0; index < 10U; ++index) {
    if (index == 4U || index == 7U) continue;
    if (value[index] < '0' || value[index] > '9') return false;
  }
  int year = value.substring(0, 4).toInt();
  int month = value.substring(5, 7).toInt();
  int day = value.substring(8, 10).toInt();
  if (year < 2000 || month < 1 || month > 12 || day < 1) return false;
  const bool leap = (year % 4 == 0 && year % 100 != 0) || year % 400 == 0;
  const uint8_t days[] = {0, 31, static_cast<uint8_t>(leap ? 29 : 28), 31, 30, 31, 30,
    31, 31, 30, 31, 30, 31};
  if (day > days[month]) return false;
  ++day;
  if (day > days[month]) {
    day = 1;
    ++month;
    if (month > 12) {
      month = 1;
      ++year;
    }
  }
  char next[11] = {0};
  snprintf(next, sizeof(next), "%04d-%02d-%02d", year, month, day);
  output = String(next);
  return true;
}

static bool validDeliveryMode(const String &value) {
  return value == "legacy_online" || value == "stock_compat"
      || value == "inktime_offline_schedule";
}

static bool validButtonWakeAction(const String &value) {
  return value == "check_new" || value == "local_next";
}

static void applyFixedTimezoneWithoutNtp(int32_t offsetMinutes) {
  const int32_t absoluteMinutes = offsetMinutes < 0 ? -offsetMinutes : offsetMinutes;
  const char sign = offsetMinutes >= 0 ? '-' : '+';  // POSIX TZ signs are reversed.
  char timezone[24] = {0};
  snprintf(
    timezone,
    sizeof(timezone),
    "UTC%c%02ld:%02ld",
    sign,
    static_cast<long>(absoluteMinutes / 60),
    static_cast<long>(absoluteMinutes % 60)
  );
  setenv("TZ", timezone, 1);
  tzset();
}

static bool applyRemoteSchedule(JsonObject remoteConfig, int schemaVersion, Config &candidate) {
  if (schemaVersion < 3) {
    inktime::OfflineSlot legacy = {};
    String schedule = remoteConfig["schedule"] | "";
    if (!parseOfflineClock(schedule, legacy)) return false;
    candidate.schedule_count = 1;
    candidate.schedule_slots[0] = legacy;
    candidate.refresh_hour = legacy.hour;
    candidate.refresh_minute = legacy.minute;
    return true;
  }
  String delivery = remoteConfig["delivery_mode"] | candidate.delivery_mode;
  String button = remoteConfig["button_wake_action"] | candidate.button_wake_action;
  const JsonVariantConst leadValue = remoteConfig["prefetch_lead_minutes"];
  if (!leadValue.isNull() && (!leadValue.is<int>() || leadValue.is<bool>())) return false;
  int lead = leadValue.isNull() ? static_cast<int>(candidate.prefetch_lead_minutes) : (leadValue | -1);
  if (!validDeliveryMode(delivery) || !validButtonWakeAction(button) || lead < 0 || lead > 120) return false;

  JsonArray rawTimes = remoteConfig["schedule_times"].as<JsonArray>();
  if (rawTimes.isNull() || rawTimes.size() == 0U || rawTimes.size() > inktime::kMaxOfflineSlots) return false;
  inktime::OfflineSlot slots[inktime::kMaxOfflineSlots] = {};
  for (size_t index = 0; index < rawTimes.size(); ++index) {
    if (!parseOfflineClock(rawTimes[index] | "", slots[index])) return false;
  }
  if (!inktime::validateOfflineSlots(slots, static_cast<uint8_t>(rawTimes.size()))) return false;
  candidate.delivery_mode = delivery;
  candidate.button_wake_action = button;
  candidate.prefetch_lead_minutes = static_cast<uint16_t>(lead);
  candidate.schedule_count = static_cast<uint8_t>(rawTimes.size());
  for (uint8_t index = 0; index < candidate.schedule_count; ++index) candidate.schedule_slots[index] = slots[index];
  candidate.refresh_hour = slots[0].hour;
  candidate.refresh_minute = slots[0].minute;
  return true;
}

#endif

Config g_cfg;
uint8_t* frameData = nullptr;
size_t frameDataSize = 0;
bool frameIndexed4 = false;
bool frameNativePalette = false;
bool serverConfigChanged = false;
bool currentPayloadShaVerified = false;
bool currentDisplaySkipped = false;
bool currentFromQueue = false;
bool currentPrefetchOnly = false;
bool enhancedNetworkWakeRequested = false;
bool currentPayloadIntegrityTrusted = false;
bool deviceAuthInvalid = false;
#if !INKTIME_PHOTOPAINTER_ENABLED
static bool displayPairingCode(const Config &cfg, const String &pairingCode);
#endif
#if INKTIME_PHOTOPAINTER_ENABLED
bool offlineScheduleTxnBlocked = false;
#endif
String portalSetupSecret;
String portalNonce;
String portalApSsid;
String portalApPassword;
uint8_t portalSaveAttempts = 0;
bool portalSaveAllowed = false;
String currentReleaseId;
String currentRenderProfile;
String currentPayloadSha256;
String currentQueueItemId;
int64_t currentQueueVersion = -1;
String lastDeviceErrorCode;
String lastDeviceErrorMessage;
uint32_t lastRefreshDurationMs = 0;

#if INKTIME_PHOTOPAINTER_ENABLED
static bool reconcilePendingScheduleConfigTransaction(Config &cfg);
#endif

