steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  struct tm t;
  localtime_r(&lastEpoch, &t);

  int curMinOfDay = t.tm_hour * 60 + t.tm_min;
  int targetMin   = (int)cfg.refresh_hour * 60 + (int)cfg.refresh_minute;
  int deltaMin;

  if (curMinOfDay < targetMin) deltaMin = targetMin - curMinOfDay;
  else                         deltaMin = 24 * 60 - (curMinOfDay - targetMin);

  if (deltaMin < 1) deltaMin = 24 * 60;
  if (deltaMin > 1440) deltaMin = 1440;
  return (uint32_t)deltaMin;
}

// =======================
//  配置读写
// =======================
static inktime::configstore::ConfigPayload configPayload(const Config &cfg) {
  inktime::configstore::ConfigPayload payload;
  payload.wifi_ssid = cfg.wifi_ssid.c_str();
  payload.wifi_pass = cfg.wifi_pass.c_str();
  payload.backend_hostport = cfg.backend_hostport.c_str();
  payload.ca_pem = cfg.ca_pem.c_str();
  payload.device_token = cfg.device_token.c_str();
  payload.device_secret = cfg.device_secret.c_str();
  payload.device_id = cfg.device_id.c_str();
  payload.auth_state = cfg.auth_state.c_str();
  payload.credential_version = cfg.credential_version;
  payload.tz_offset_minutes = cfg.tz_offset_minutes;
  payload.refresh_hour = cfg.refresh_hour;
  payload.refresh_minute = cfg.refresh_minute;
  payload.rotate180 = cfg.rotate180;
  payload.config_version = cfg.config_version;
#if INKTIME_PHOTOPAINTER_ENABLED
  payload.schedule_count = cfg.schedule_count;
  payload.prefetch_lead_minutes = cfg.prefetch_lead_minutes;
  payload.delivery_mode = cfg.delivery_mode.c_str();
  payload.button_wake_action = cfg.button_wake_action.c_str();
  for (uint8_t index = 0U; index < inktime::configstore::kMaxConfigSlots; ++index) {
    payload.schedule_slots[index] = {
      cfg.schedule_slots[index].hour,
      cfg.schedule_slots[index].minute,
    };
  }
#else
  payload.schedule_count = 1U;
  payload.schedule_slots[0] = {cfg.refresh_hour, cfg.refresh_minute};
  payload.delivery_mode = "legacy_online";
  payload.button_wake_action = "check_new";
#endif
  return payload;
}

static void applyConfigPayload(const inktime::configstore::ConfigPayload &payload, Config &cfg) {
  cfg.wifi_ssid = payload.wifi_ssid.c_str();
  cfg.wifi_pass = payload.wifi_pass.c_str();
  cfg.backend_hostport = payload.backend_hostport.c_str();
  cfg.ca_pem = payload.ca_pem.c_str();
  cfg.device_token = payload.device_token.c_str();
  cfg.device_secret = payload.device_secret.c_str();
  cfg.device_id = payload.device_id.c_str();
  cfg.auth_state = payload.auth_state.c_str();
  cfg.credential_version = payload.credential_version;
  if (cfg.auth_state.length() == 0U) {
    cfg.auth_state = cfg.device_secret.length() > 0U || cfg.device_token.length() > 0U
      ? "paired" : "unpaired";
  }
  cfg.tz_offset_minutes = payload.tz_offset_minutes;
  cfg.refresh_hour = payload.refresh_hour;
  cfg.refresh_minute = payload.refresh_minute;
  cfg.rotate180 = payload.rotate180;
  cfg.config_version = payload.config_version;
#if INKTIME_PHOTOPAINTER_ENABLED
  cfg.schedule_count = payload.schedule_count;
  cfg.prefetch_lead_minutes = payload.prefetch_lead_minutes;
  cfg.delivery_mode = payload.delivery_mode.c_str();
  cfg.button_wake_action = payload.button_wake_action.c_str();
  for (uint8_t index = 0U; index < inktime::kMaxOfflineSlots; ++index) {
    cfg.schedule_slots[index] = {
      payload.schedule_slots[index].hour,
      payload.schedule_slots[index].minute,
    };
  }
#endif
  cfg.valid = cfg.wifi_ssid.length() > 0U;
}

static void setConfigDefaults(Config &cfg) {
  cfg = Config{};
  cfg.backend_hostport = DEFAULT_HOSTPORT;
  cfg.tz_offset_minutes = DEFAULT_TZ_MINUTES;
  cfg.refresh_hour = DEFAULT_HOUR;
  cfg.refresh_minute = DEFAULT_MINUTE;
  cfg.rotate180 = false;
  cfg.config_version = 0U;
  cfg.credential_version = 0U;
  cfg.auth_state = "unpaired";
#if INKTIME_PHOTOPAINTER_ENABLED
  cfg.schedule_count = 1U;
  cfg.schedule_slots[0] = {DEFAULT_HOUR, DEFAULT_MINUTE};
  for (uint8_t index = 1U; index < inktime::kMaxOfflineSlots; ++index) {
    cfg.schedule_slots[index] = {0U, 0U};
  }
  cfg.prefetch_lead_minutes = DEFAULT_PREFETCH_LEAD_MINUTES;
  cfg.delivery_mode = "legacy_online";
  cfg.button_wake_action = "check_new";
#endif
}

void loadConfig(Config &cfg) {
  setConfigDefaults(cfg);
  inktime::configstore::ConfigPayload payload;
  String loadError;
  if (configStore.load(payload, loadError)) {
    applyConfigPayload(payload, cfg);
  } else if (loadError.length() > 0U) {
    setConfigPersistenceError(loadError);
  }
  cfg.valid = (cfg.wifi_ssid.length() > 0);

#if DEBUG_LOG
  DBG_PRINTLN("---- loadConfig ----");
  DBG_PRINT("[CFG] ssid="); DBG_PRINTLN(cfg.wifi_ssid);
  DBG_PRINT("[CFG] hostport="); DBG_PRINTLN(cfg.backend_hostport);
  DBG_PRINT("[CFG] tz_offset_minutes="); DBG_PRINTLN(cfg.tz_offset_minutes);
  DBG_PRINT("[CFG] refresh_hour="); DBG_PRINTLN((int)cfg.refresh_hour);
  DBG_PRINT("[CFG] refresh_minute="); DBG_PRINTLN((int)cfg.refresh_minute);
  DBG_PRINT("[CFG] rotate180="); DBG_PRINTLN(cfg.rotate180 ? "true" : "false");
  DBG_PRINT("[CFG] valid="); DBG_PRINTLN(cfg.valid ? "true" : "false");
#endif
}

static bool verifyLegacyConfigReadback(const Config &cfg, String &error) {
  error = "";
  Preferences verify;
  if (!verify.begin("dashcfg", true)) {
    error = "PAIRING-NVS-002";
    return false;
  }
  const String verifiedCaPem = verify.getString("ca_pem", "");
  const String verifiedHostport = verify.getString("hostport", "");
  const String verifiedSsid = verify.getString("ssid", "");
  const bool legacyPresent = verifiedCaPem.length() > 0U
    || verifiedHostport.length() > 0U
    || verifiedSsid.length() > 0U;
  const bool matches = !legacyPresent
    || (verifiedCaPem == cfg.ca_pem
      && verifiedHostport == cfg.backend_hostport
      && verifiedSsid == cfg.wifi_ssid);
  verify.end();
  if (!matches) {
    error = "PAIRING-NVS-003";
    return false;
  }
  return true;
}

bool saveConfig(const Config &cfg, String *errorCodeOut = nullptr) {
  if (errorCodeOut != nullptr) *errorCodeOut = "";
  auto setError = [errorCodeOut](const char *code) {
    if (errorCodeOut != nullptr) *errorCodeOut = code;
  };
  if (cfg.ca_pem.length() > inktime::kMaxDeviceCaPemBytes
      || (cfg.ca_pem.length() > 0 && !inktime::DeviceHttpTransport::trustAnchorValid(cfg.ca_pem))) {
    setError("DEVICE-TLS-CA-INVALID");
    return false;
  }
  String transportError;
  String transportBase = cfg.backend_hostport;
  transportBase.trim();
  if (!transportBase.startsWith("http://") && !transportBase.startsWith("https://")) {
    transportBase = "https://" + transportBase;
  }
  if (!inktime::DeviceHttpTransport::backendUrlAllowed(
        transportBase, cfg.ca_pem, transportError)) {
    setError(transportError.length() > 0U ? transportError.c_str() : "DEVICE-URL-INVALID");
    return false;
  }
  const inktime::configstore::ConfigPayload payload = configPayload(cfg);
  String storeError;
  if (!configStore.save(payload, storeError)) {
    if (storeError == "PAIRING-NVS-002") {
      setError("PAIRING-NVS-002");
    } else if (storeError == "PAIRING-NVS-003") {
      setError("PAIRING-NVS-003");
    } else if (storeError == "PAIRING-NVS-004") {
      setError("PAIRING-NVS-004");
    } else if (storeError == "PAIRING-NVS-005") {
      setError("PAIRING-NVS-005");
    } else if (storeError == "PAIRING-NVS-006") {
      setError("PAIRING-NVS-006");
    } else if (storeError == "PAIRING-NVS-007") {
      setError("PAIRING-NVS-007");
    } else {
      setError(storeError.length() > 0U ? storeError.c_str() : "PAIRING-NVS-001");
    }
    return false;
  }
  // cfgstore has already completed the formal A/B commit and full read-back.
  // Old dashcfg formal keys are migration-only; stale legacy values must not
  // turn a committed config into a reported failure.
  String legacyReadbackError;
  (void)verifyLegacyConfigReadback(cfg, legacyReadbackError);

#if DEBUG_LOG
  DBG_PRINTLN("[CFG] saved");
#endif
  setError("");
  return true;
}

static String deviceCredential(const Config &cfg) {
  return cfg.device_secret.length() > 0U ? cfg.device_secret : cfg.device_token;
}

static bool hasDeviceCredential(const Config &cfg) {
  return !deviceAuthInvalid && deviceCredential(cfg).length() > 0U;
}

static bool addDeviceAuthorization(HTTPClient &http, const Config &cfg) {
  const String credential = deviceCredential(cfg);
  if (!hasDeviceCredential(cfg)) return false;
  http.addHeader("Authorization", "Bearer " + credential);
  if (cfg.device_secret.length() > 0U && cfg.credential_version > 0U) {
    http.addHeader("X-InkTime-Credential-Version", String(cfg.credential_version));
  }
  return true;
}

static void markDeviceAuthInvalid(Config &cfg, int statusCode) {
  deviceAuthInvalid = true;
  lastDeviceErrorCode = statusCode == 403 ? "DEVICE-AUTH-REVOKED" : "DEVICE-AUTH-INVALID";
  lastDeviceErrorMessage = statusCode == 403
    ? "伺服器撤銷或拒絕裝置認證；需由管理員允許重新配對"
    : "伺服器拒絕裝置認證；保留 credential 並停止本輪網路工作";
  Config candidate = cfg;
  candidate.auth_state = statusCode == 403 ? "revoked" : "auth_invalid";
  String persistError;
  if (!saveConfig(candidate, &persistError)) {
    setConfigPersistenceError(persistError);
    return;
  }
  cfg = candidate;
}

static bool handleDeviceAuthStatus(Config &cfg, int statusCode) {
  if (statusCode != HTTP_CODE_UNAUTHORIZED && statusCode != HTTP_CODE_FORBIDDEN) return false;
  markDeviceAuthInvalid(cfg, statusCode);
  return true;
}

// =======================
//  HTML 工具
// =======================
String htmlEscape(const String &s) {
  String out;
  out.reserve(s.length());
  for (size_t i = 0; i < s.length(); ++i) {
    char c = s[i];
    if      (c == '&')  out += F("&amp;");
    else if (c == '<')  out += F("&lt;");
    else if (c == '>')  out += F("&gt;");
    else if (c == '"')  out += F("&quot;");
    else                out += c;
  }
  return out;
}

static void wifiHardResetForPortal() {
#if DEBUG_LOG
  DBG_PRINTLN("[WIFI] wifiHardResetForPortal()");
#endif
  WiFi.scanDelete();
  WiFi.disconnect(false, false);
  WiFi.mode(WIFI_OFF);
  delay(200);

  WiFi.mode(WIFI_AP_STA);

