steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static bool performAutomaticPairing(Config &cfg) {
  if (!automaticPairingAllowed(cfg)) {
    return cfg.auth_state == "paired" && deviceCredential(cfg).length() > 0U && !deviceAuthInvalid;
  }
  String base;
  if (!normalizedBackendBase(cfg, base)) return false;

  Config identityCandidate = cfg;
  if (identityCandidate.device_id.length() == 0U) {
    identityCandidate.device_id = String("esp32-") + randomPortalSecret();
    String persistError;
    if (!saveConfig(identityCandidate, &persistError)) {
      setConfigPersistenceError(persistError);
      return false;
    }
    cfg = identityCandidate;
  }
  const String pairingNonce = randomPortalSecret();
  JsonDocument pairingRequest;
  pairingRequest["device_id"] = cfg.device_id;
  pairingRequest["pairing_nonce"] = pairingNonce;
  pairingRequest["firmware_identity"] = kBoardConfig.name;
  pairingRequest["firmware_version"] = INKTIME_FIRMWARE_VERSION;
  pairingRequest["panel_profile"] = INKTIME_PANEL_PROFILE;
  JsonObject capabilities = pairingRequest["capabilities"].to<JsonObject>();
  capabilities["automatic_pairing"] = true;
  capabilities["ab_credential_store"] = true;
  capabilities["stock_compatibility"] = true;
  capabilities["deep_sleep"] = true;
  String requestBody;
  serializeJson(pairingRequest, requestBody);

  inktime::DeviceHttpTransport requestTransport(cfg.ca_pem);
  HTTPClient requestHttp;
  String transportCode;
  String transportMessage;
  if (!requestTransport.begin(
        requestHttp, base + String(DEVICE_PAIRING_REQUEST_PATH), 15000,
        transportCode, transportMessage)) {
    lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-PAIRING-URL";
    lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "配對 request URL 無法初始化";
    return false;
  }
  const char* pairingHeaders[] = {"Content-Type"};
  requestHttp.collectHeaders(pairingHeaders, 1);
  requestHttp.addHeader("Content-Type", "application/json");
  const int requestStatus = requestHttp.POST(requestBody);
  const int requestLength = requestHttp.getSize();
  const String requestContentType = requestHttp.header("Content-Type");
  if (requestStatus != HTTP_CODE_CREATED || requestLength <= 0 || requestLength > 8192
      || !requestContentType.startsWith("application/json")) {
    requestHttp.end();
    lastDeviceErrorCode = "DEVICE-PAIRING-REQUEST";
    lastDeviceErrorMessage = "配對 request HTTP／Content-Type／長度不合法";
    return false;
  }
  JsonDocument requestResponse;
  const DeserializationError requestJsonError = deserializeJson(requestResponse, requestHttp.getStream());
  requestHttp.end();
  const String pairingId = requestResponse["pairing_id"] | "";
  const String pairingCode = requestResponse["pairing_code"] | "";
  const JsonVariantConst expiresValue = requestResponse["expires_in_seconds"];
  if (requestJsonError || requestResponse.overflowed() || pairingId.length() == 0U
      || pairingCode.length() != 6U || !expiresValue.is<int32_t>() || expiresValue.is<bool>()
      || expiresValue.as<int32_t>() < 1 || expiresValue.as<int32_t>() > 600) {
    lastDeviceErrorCode = "DEVICE-PAIRING-SCHEMA";
    lastDeviceErrorMessage = "配對 request 回應 schema 不合法";
    return false;
  }
  if (!persistPairingState(cfg, "pairing_pending")) return false;
#if INKTIME_PHOTOPAINTER_ENABLED
  (void)photoPainter.displayPairingScreen(
    cfg.wifi_ssid.c_str(), "", base.c_str(), pairingCode.c_str());
#else
  (void)displayPairingCode(cfg, pairingCode);
#endif

  const uint32_t pollWindowMs = static_cast<uint32_t>(expiresValue.as<int32_t>()) * 1000U;
  const uint32_t pollStarted = millis();
  while (static_cast<uint32_t>(millis() - pollStarted) < pollWindowMs) {
    JsonDocument claimRequest;
    claimRequest["pairing_id"] = pairingId;
    claimRequest["pairing_nonce"] = pairingNonce;
    String claimBody;
    serializeJson(claimRequest, claimBody);
    inktime::DeviceHttpTransport claimTransport(cfg.ca_pem);
    HTTPClient claimHttp;
    String claimTransportCode;
    String claimTransportMessage;
    if (!claimTransport.begin(
          claimHttp, base + String(DEVICE_PAIRING_CLAIM_PATH), 15000,
          claimTransportCode, claimTransportMessage)) {
      lastDeviceErrorCode = claimTransportCode.length() ? claimTransportCode : "DEVICE-PAIRING-CLAIM-URL";
      lastDeviceErrorMessage = claimTransportMessage.length() ? claimTransportMessage : "配對 claim URL 無法初始化";
      return false;
    }
    claimHttp.collectHeaders(pairingHeaders, 1);
    claimHttp.addHeader("Content-Type", "application/json");
    const int claimStatus = claimHttp.POST(claimBody);
    const int claimLength = claimHttp.getSize();
    const String claimContentType = claimHttp.header("Content-Type");
    if (claimStatus == HTTP_CODE_ACCEPTED) {
      claimHttp.end();
      delay(3000U);
      continue;
    }
    if (claimStatus == HTTP_CODE_GONE) {
      claimHttp.end();
      (void)persistPairingState(cfg, "pairing_expired");
      lastDeviceErrorCode = "DEVICE-PAIRING-EXPIRED";
      lastDeviceErrorMessage = "配對碼已過期，請重新建立配對；裝置不會無限輪詢";
      return false;
    }
    if (claimStatus != HTTP_CODE_OK || claimLength <= 0 || claimLength > 8192
        || !claimContentType.startsWith("application/json")) {
      claimHttp.end();
      lastDeviceErrorCode = "DEVICE-PAIRING-CLAIM";
      lastDeviceErrorMessage = "配對 claim HTTP／Content-Type／長度不合法";
      return false;
    }
    JsonDocument claimResponse;
    const DeserializationError claimJsonError = deserializeJson(claimResponse, claimHttp.getStream());
    claimHttp.end();
    const String secret = claimResponse["device_secret"] | "";
    const JsonVariantConst versionValue = claimResponse["credential_version"];
    const String claimedDeviceId = claimResponse["device_id"] | "";
    if (claimJsonError || claimResponse.overflowed() || secret.length() < 32U
        || secret.length() > inktime::configstore::kMaxDeviceSecretBytes
        || !versionValue.is<uint32_t>() || versionValue.is<bool>() || versionValue.as<uint32_t>() == 0U
        || claimedDeviceId != cfg.device_id) {
      lastDeviceErrorCode = "DEVICE-PAIRING-SCHEMA";
      lastDeviceErrorMessage = "配對 claim credential schema 不合法";
      return false;
    }
    Config candidate = cfg;
    candidate.device_secret = secret;
    candidate.credential_version = versionValue.as<uint32_t>();
    candidate.auth_state = "paired";
#if INKTIME_PHOTOPAINTER_ENABLED
    JsonObject claimConfig = claimResponse["config"].as<JsonObject>();
    const String delivery = claimConfig["delivery_mode"] | candidate.delivery_mode;
    const String button = claimConfig["button_wake_action"] | candidate.button_wake_action;
    if (validDeliveryMode(delivery)) candidate.delivery_mode = delivery;
    if (validButtonWakeAction(button)) candidate.button_wake_action = button;
#endif
    String persistError;
    if (!saveConfig(candidate, &persistError)) {
      setConfigPersistenceError(persistError);
      return false;
    }
    cfg = candidate;
    deviceAuthInvalid = false;
    lastDeviceErrorCode = "";
    lastDeviceErrorMessage = "";
    return true;
  }
  (void)persistPairingState(cfg, "pairing_expired");
  lastDeviceErrorCode = "DEVICE-PAIRING-TIMEOUT";
  lastDeviceErrorMessage = "管理員核准逾時；配對碼已失效，請重新建立配對";
  return false;
}

static bool queueAckIdempotencyKey(const PendingQueueAck &pending, String &key) {
  char material[320];
  if (!inktime::idempotencyMaterial(
        pending.queueItemId.c_str(), pending.queueVersion, pending.event, material, sizeof(material))) {
    return false;
  }
  unsigned char digest[32];
  if (calculateSha256(
        reinterpret_cast<const unsigned char*>(material), strlen(material), digest) != 0) {
    return false;
  }
  char output[65];
  for (size_t index = 0; index < 32U; ++index) {
    snprintf(output + index * 2U, 3U, "%02x", digest[index]);
  }
  output[64] = '\0';
  key = output;
  return true;
}

static bool sendQueueAck(Config &cfg, const PendingQueueAck &pending, bool persistFirst) {
  if (!pending.valid) return false;
  if (persistFirst) persistPendingQueueAck(pending);
  String base;
  if (WiFi.status() != WL_CONNECTED || !normalizedBackendBase(cfg, base)) return false;
  String idempotencyKey;
  if (!queueAckIdempotencyKey(pending, idempotencyKey)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-KEY";
    lastDeviceErrorMessage = "Queue ACK idempotency key 無法建立";
    return false;
  }
  JsonDocument payload;
  payload["queue_item_id"] = pending.queueItemId;
  payload["queue_version"] = pending.queueVersion;
  payload["event"] = inktime::queueEventName(pending.event);
  payload["idempotency_key"] = idempotencyKey;
  if (pending.displaySkipped) {
    payload["display_skipped"] = true;
    payload["skip_reason"] = "same_sha256";
  }
  if (pending.delayedTerminal) {
    payload["ack_mode"] = "delayed_terminal";
    payload["release_id"] = pending.releaseId;
    if (pending.eventEpoch > 0) payload["event_epoch"] = pending.eventEpoch;
  }
  if (pending.errorCode.length() > 0U) payload["error_code"] = pending.errorCode;
  String body;
  serializeJson(payload, body);

  for (uint8_t attempt = 0; attempt <= inktime::kQueueRetryLimit; ++attempt) {
    inktime::DeviceHttpTransport transport(cfg.ca_pem);
    HTTPClient ackHttp;
    String transportCode;
    String transportMessage;
    if (!transport.begin(ackHttp, base + String(DEVICE_QUEUE_ACK_PATH), 15000, transportCode, transportMessage)) {
      lastDeviceErrorCode = transportCode;
      lastDeviceErrorMessage = transportMessage;
      break;
    }
    if (!addDeviceAuthorization(ackHttp, cfg)) {
      ackHttp.end();
      return false;
    }
    ackHttp.addHeader("Content-Type", "application/json");
    const int status = ackHttp.POST(body);
    const bool authFailed = handleDeviceAuthStatus(cfg, status);
    ackHttp.end();
    if (authFailed) return false;
    const inktime::AckDecision decision = inktime::ackDecision(status, attempt);
    if (decision == inktime::AckDecision::Accepted) {
      removePendingQueueAck(pending);
      return true;
    }
    if (decision == inktime::AckDecision::StaleManifest) {
      removePendingQueueAck(pending);
      lastDeviceErrorCode = "DEVICE-QUEUE-STALE";
      lastDeviceErrorMessage = "QUEUE-003 Queue version 已過期；下次重新取得 Manifest";
      return false;
    }
    if (decision == inktime::AckDecision::AuthorizationFailed) {
      lastDeviceErrorCode = "DEVICE-QUEUE-AUTH";
      lastDeviceErrorMessage = "Queue ACK Token／authorization 被拒絕";
      return false;
    }
    if (decision != inktime::AckDecision::Retry) break;
    delay(250U * (attempt + 1U));
  }
  lastDeviceErrorCode = "DEVICE-QUEUE-ACK-RETRY";
  lastDeviceErrorMessage = "Queue ACK 已達有界 retry 上限；pending event 已保留";
  return false;
}

static bool sendQueueEvent(
  Config &cfg,
  inktime::QueueEvent event,
  bool displaySkipped = false,
  const String &errorCode = String(""),
  bool delayedTerminal = false
) {
  const time_t eventNow = time(nullptr);
  PendingQueueAck pending = {
    currentQueueItemId,
    static_cast<int32_t>(currentQueueVersion),
    event,
    displaySkipped,
    errorCode.substring(0, 64),
    delayedTerminal,
    currentReleaseId,
    delayedTerminal && eventNow > 0 ? static_cast<int64_t>(eventNow) : 0,
    currentQueueItemId.length() > 0U && currentQueueVersion >= 0,
  };
  return sendQueueAck(cfg, pending, true);
}

